# Pandas 기초

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### Pandas 개념
- pandas 는 dict 를 확장한 개념이다
- 2차원 테이블 형태를 주로 다룬다
- 주로 칼럼 위주로 처리가 일어난다
- pandas 데이터에는 항상 칼럼명과 인덱스가 붙는다
- 데이터타입 종류
    - pd.DataFrame
    - pd.Series

In [2]:
d = {'a':[1,2], 'b': [11,12], 'c': [21,22]}
df = pd.DataFrame(d)
df

   a   b   c
0  1  11  21
1  2  12  22

In [4]:
df['b']

0    11
1    12
Name: b, dtype: int64

In [8]:
type(df), type(df['a'])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [5]:
df2 = pd.DataFrame(np.arange(12).reshape(4,3))
df2

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [7]:
df2[2] # 칼럼명이 0인 열을 가져온다

0     2
1     5
2     8
3    11
Name: 2, dtype: int32

In [13]:
df2.values

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

### Series

In [46]:
s = pd.Series([11,12,13,14])
s

0    11
1    12
2    13
3    14
dtype: int64

In [47]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [48]:
s.index = range(100,104)

In [49]:
s

100    11
101    12
102    13
103    14
dtype: int64

In [50]:
s.name

In [51]:
s.name='test'
s

100    11
101    12
102    13
103    14
Name: test, dtype: int64

In [53]:
s[100]

11

In [54]:
s[[100,102]]

100    11
102    13
Name: test, dtype: int64

In [15]:
s[[True,False, False,True]]

10    1
13    4
Name: test, dtype: int64

In [16]:
s.name, s.index.name

('test', None)

In [18]:
s.index.name = 'num'
s.name, s.index.name

('test', 'num')

### DataFrame

In [15]:
d = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
d

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [16]:
d.columns

RangeIndex(start=0, stop=3, step=1)

In [17]:
d.index

RangeIndex(start=0, stop=3, step=1)

In [2]:
d = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=['col1','col2','col3'])
d

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

In [3]:
d.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [4]:
d.index

RangeIndex(start=0, stop=3, step=1)

In [5]:
d.columns = ['a','b','c'] # list('abc')

In [6]:
d

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [7]:
d.index=['row1','row2','row3']
d

      a  b  c
row1  1  2  3
row2  4  5  6
row3  7  8  9

In [8]:
d.index = range(3)
d

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [9]:
d['c']

0    3
1    6
2    9
Name: c, dtype: int64

In [10]:
d['c'][1], d['b'][2]

(6, 8)

- numpy 식으로 인덱싱/슬라이싱 => d.iloc[행번호,열번호]

In [11]:
d

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [20]:
d.iloc[1,2], d.iloc[2,1]

(6, 8)

In [26]:
d.iloc[0]

a    1
b    2
c    3
Name: 0, dtype: int64

In [27]:
d.iloc[0,2]

3

In [28]:
d.iloc[:1,1:]

   b  c
0  2  3

- s.name 은 칼럼명, s.index.name 은 d.index.name 이 된다

In [21]:
d.index.name

'num'

In [22]:
d.columns

Index(['test'], dtype='object')

In [23]:
d.index

RangeIndex(start=10, stop=14, step=1, name='num')

In [29]:
d = pd.DataFrame({'name': ['hong', 'jang', 'dooley'],
                 'age': [22,33,11],
                 'address': ['seoul', 'daejeon', 'etc']})
d

   address  age    name
0    seoul   22    hong
1  daejeon   33    jang
2      etc   11  dooley

In [12]:
d = pd.DataFrame([['hong',22,'seoul'], ['jang',33,'daejeon'], ['dooley',11,'etc']],
                columns=['name','age','address'])
d

     name  age  address
0    hong   22    seoul
1    jang   33  daejeon
2  dooley   11      etc

In [32]:
d = pd.DataFrame([['hong',22,'seoul'], ['jang',33,'daejeon'], ['dooley',11,'etc']])
d.columns = ['name','age','address']
d

     name  age  address
0    hong   22    seoul
1    jang   33  daejeon
2  dooley   11      etc

- 칼럼 하나를 뽑아내면 Series 가 된다.
- 칼럼명은 Series 의 name 이 된다

In [33]:
d['name']

0      hong
1      jang
2    dooley
Name: name, dtype: object

In [34]:
type(d['name'])

pandas.core.series.Series

In [35]:
d.shape

(3, 3)

In [36]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
name       3 non-null object
age        3 non-null int64
address    3 non-null object
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [37]:
d.describe()

        age
count   3.0
mean   22.0
std    11.0
min    11.0
25%    16.5
50%    22.0
75%    27.5
max    33.0

- 팬시 색인은 칼럼을 선택하고, 불리언 색인은 레코드를 선택한다
- 범위를 지정하면 레코드가 선택된다

In [23]:
d

     name  age  address
0    hong   22    seoul
1    jang   33  daejeon
2  dooley   11      etc

In [40]:
d[['name','age']] # 팬시 색인

     name  age
0    hong   22
1    jang   33
2  dooley   11

In [41]:
d.iloc[:2]

   name  age  address
0  hong   22    seoul
1  jang   33  daejeon

In [42]:
d[:2] # 범위(슬라이싱) 지정

   name  age  address
0  hong   22    seoul
1  jang   33  daejeon

In [16]:
d[[True, True, False]]

   name  age  address
0  hong   22    seoul
1  jang   33  daejeon

In [14]:
d[d['age']>20] # select * from d where age>20

   name  age  address
0  hong   22    seoul
1  jang   33  daejeon

In [15]:
d['age']>20

0     True
1     True
2    False
Name: age, dtype: bool

### 칼럼명으로 칼럼 지정

In [26]:
d

     name  age  address
0    hong   22    seoul
1    jang   33  daejeon
2  dooley   11      etc

In [44]:
d['name']

0      hong
1      jang
2    dooley
Name: name, dtype: object

In [45]:
d.name

0      hong
1      jang
2    dooley
Name: name, dtype: object

In [27]:
d.age

0    22
1    33
2    11
Name: age, dtype: int64

In [28]:
d.address

0      seoul
1    daejeon
2        etc
Name: address, dtype: object

In [38]:
d.name[:2]

0    hong
1    jang
Name: name, dtype: object

In [39]:
d['name'][:2]

0    hong
1    jang
Name: name, dtype: object

### NULL 처리
- None 또는 np.nan 으로 널값을 할당 할 수 있다
- None, null, nan, NaN, np.nan, na

In [17]:
#0,,2
#3,4,5

d = pd.DataFrame([[0,None,2], [3,4,5]]) # np.nan
d

   0    1  2
0  0  NaN  2
1  3  4.0  5

In [18]:
d[1][0] # d.iloc[0,1]

nan

In [19]:
type(d[1][0])

numpy.float64

In [49]:
d[2][1]=None
d

   0    1    2
0  0  NaN  2.0
1  3  4.0  NaN

In [50]:
d.iloc[1,0] = None
d

     0    1    2
0  0.0  NaN  2.0
1  NaN  4.0  NaN

In [51]:
d.isna()

       0      1      2
0  False   True  False
1   True  False   True

In [52]:
d.isnull()

       0      1      2
0  False   True  False
1   True  False   True

In [54]:
d.notnull()

       0      1      2
0   True  False   True
1  False   True  False

### DataFrame 이름 부여

In [58]:
d = pd.DataFrame([[0,1],[2,3],[4,5]])
d

   0  1
0  0  1
1  2  3
2  4  5

In [59]:
d.index.name = 'num'
d.columns.name = 'cols'
d

cols  0  1
num
0     0  1
1     2  3
2     4  5

In [60]:
d.columns = ['col1','col2']
d.index = [100,101,102]
d

     col1  col2
100     0     1
101     2     3
102     4     5

In [61]:
d.index.name = 'nums'
d.columns.name = 'cols'
d

cols  col1  col2
nums
100      0     1
101      2     3
102      4     5

### 항목 찾기

In [64]:
d.loc[101,'col2']

3

In [67]:
d.iloc[1,1]

3

In [69]:
d.iloc[:2,1:]

cols  col2
nums
100      1
101      3

In [70]:
d.iloc[0] # 결과는 Series

cols
col1    0
col2    1
Name: 100, dtype: int64

### 인덱스

In [71]:
d = pd.DataFrame(np.arange(12).reshape(4,3))
d

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [72]:
display(d.columns, d.index)

RangeIndex(start=0, stop=3, step=1)

RangeIndex(start=0, stop=4, step=1)

In [2]:
d = pd.DataFrame(np.arange(12).reshape(4,3),
                 columns=['col1','col2','col3'],
                 index=[101,102,103,104])
d

     col1  col2  col3
101     0     1     2
102     3     4     5
103     6     7     8
104     9    10    11

In [78]:
display(d.columns, d.index)

Index(['col1', 'col2', 'col3'], dtype='object')

Int64Index([101, 102, 103, 104], dtype='int64')

In [79]:
d.index=list('abcd')
d

   col1  col2  col3
a     0     1     2
b     3     4     5
c     6     7     8
d     9    10    11

In [80]:
d.index

Index(['a', 'b', 'c', 'd'], dtype='object')

### reindex()
- 기존의 인덱스를 재배치한다

In [82]:
d.reindex(list('dcba'))

   col1  col2  col3
d     9    10    11
c     6     7     8
b     3     4     5
a     0     1     2

In [85]:
d

   col1  col2  col3
a     0     1     2
b     3     4     5
c     6     7     8
d     9    10    11

In [86]:
d.reindex(list('abcde'))

   col1  col2  col3
a   0.0   1.0   2.0
b   3.0   4.0   5.0
c   6.0   7.0   8.0
d   9.0  10.0  11.0
e   NaN   NaN   NaN

In [87]:
d.reindex(list('abcde'), fill_value=0)

   col1  col2  col3
a     0     1     2
b     3     4     5
c     6     7     8
d     9    10    11
e     0     0     0

In [88]:
d.reindex(columns=['col2','col3','col4'])

   col2  col3  col4
a     1     2   NaN
b     4     5   NaN
c     7     8   NaN
d    10    11   NaN

### set_index(), reset_index()

In [20]:
data = pd.DataFrame([['hong',22,'seoul','hong@naver.com'],
                  ['jang',33,'incheon','jang@gmail.com'],
                  ['dooley',11,'etc','dooley@andromeda.uni']],
                columns=['name','age','address','email'])
data

     name  age  address                 email
0    hong   22    seoul        hong@naver.com
1    jang   33  incheon        jang@gmail.com
2  dooley   11      etc  dooley@andromeda.uni

In [58]:
data2 = data.set_index('name')
data2

        age  address                 email
name
hong     22    seoul        hong@naver.com
jang     33  incheon        jang@gmail.com
dooley   11      etc  dooley@andromeda.uni

In [104]:
data2.reset_index()

     name  age  address                 email
0    hong   22    seoul        hong@naver.com
1    jang   33  incheon        jang@gmail.com
2  dooley   11      etc  dooley@andromeda.uni

In [105]:
data2.reset_index(drop=True)

   age  address                 email
0   22    seoul        hong@naver.com
1   33  incheon        jang@gmail.com
2   11      etc  dooley@andromeda.uni

In [34]:
data3 = data[::-1]
data3

     name  age  address                 email
2  dooley   11      etc  dooley@andromeda.uni
1    jang   33  incheon        jang@gmail.com
0    hong   22    seoul        hong@naver.com

In [35]:
data3.reset_index()

   index    name  age  address                 email
0      2  dooley   11      etc  dooley@andromeda.uni
1      1    jang   33  incheon        jang@gmail.com
2      0    hong   22    seoul        hong@naver.com

In [108]:
data3.reset_index(drop=True)

     name  age  address                 email
0  dooley   11      etc  dooley@andromeda.uni
1    jang   33  incheon        jang@gmail.com
2    hong   22    seoul        hong@naver.com

### 칼럼 범위

In [36]:
d = pd.DataFrame(np.arange(12).reshape(4,3), columns=['col1','col2','col3'])
d

   col1  col2  col3
0     0     1     2
1     3     4     5
2     6     7     8
3     9    10    11

In [37]:
d = pd.DataFrame({'col1':[0,3,6,9], 'col2':[1,4,7,10], 'col3':range(2,12,3)})
d

   col1  col2  col3
0     0     1     2
1     3     4     5
2     6     7     8
3     9    10    11

In [39]:
#d.index = ['a','b','c','d']
d.index=list('abcd')
d

   col1  col2  col3
a     0     1     2
b     3     4     5
c     6     7     8
d     9    10    11

In [90]:
d

   col1  col2  col3
a     0     1     2
b     3     4     5
c     6     7     8
d     9    10    11

In [91]:
d['col1'] # Series, d.col1

a    0
b    3
c    6
d    9
Name: col1, dtype: int32

In [93]:
d[['col1']] # DataFrame

   col1
a     0
b     3
c     6
d     9

In [40]:
d[['col1','col2']]

   col1  col2
a     0     1
b     3     4
c     6     7
d     9    10

### 산술 연산

In [42]:
a = pd.DataFrame(np.arange(9).reshape(3,3))
b = pd.DataFrame(np.ones([3,3]))
display(a,b)

   0  1  2
0  0  1  2
1  3  4  5
2  6  7  8

     0    1    2
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0

In [95]:
a + b

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  6.0
2  7.0  8.0  9.0

In [5]:
a + [1,2,3] # broadcasting

   0  1   2
0  1  3   5
1  4  6   8
2  7  9  11

In [8]:
#a + np.array([[1],[2],[3]]) # error!

In [46]:
a.index = [0,1,99]
a

    0  1  2
0   0  1  2
1   3  4  5
99  6  7  8

In [44]:
b

     0    1    2
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0

In [47]:
a + b

      0    1    2
0   1.0  2.0  3.0
1   4.0  5.0  6.0
2   NaN  NaN  NaN
99  NaN  NaN  NaN

In [48]:
a.columns = [0,1,99]
a

    0   1   99
0    0   1   2
1    3   4   5
99   6   7   8

In [49]:
a + b

     0    1   2   99
0   1.0  2.0 NaN NaN
1   4.0  5.0 NaN NaN
2   NaN  NaN NaN NaN
99  NaN  NaN NaN NaN

In [50]:
display(a,b)

    0   1   99
0    0   1   2
1    3   4   5
99   6   7   8

     0    1    2
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0

In [51]:
a.add(b, fill_value=0)

     0    1    2    99
0   1.0  2.0  1.0  2.0
1   4.0  5.0  1.0  5.0
2   1.0  1.0  1.0  NaN
99  6.0  7.0  NaN  8.0

### 함수 적용
- apply() : 데이터프레임에 칼럼별로 적용
- applymap() : 데이터프레임에 항목별로 적용
- map() : 시리즈에 항목별로 적용

In [23]:
d = pd.DataFrame(np.arange(12).reshape(4,3), columns=list('abc'))
d

   a   b   c
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [55]:
d.applymap(lambda x: x%2) # 항목 하나하나 계산

   a  b  c
0  0  1  0
1  1  0  1
2  0  1  0
3  1  0  1

In [11]:
d.apply(lambda s: s.max() - s.min()) # s: 칼럼(속성, 시리즈)

a    9
b    9
c    9
dtype: int64

In [57]:
d.apply(lambda s: s-s.min())

   a  b  c
0  0  0  0
1  3  3  3
2  6  6  6
3  9  9  9

In [61]:
d.apply(lambda s: (s-s.mean())/s.std())

          a         b         c
0 -1.161895 -1.161895 -1.161895
1 -0.387298 -0.387298 -0.387298
2  0.387298  0.387298  0.387298
3  1.161895  1.161895  1.161895

In [27]:
d.apply(lambda s: pd.Series([s.sum(), s.mean(), s.std()], index=['sum','mean','std']))

              a          b          c
sum   18.000000  22.000000  26.000000
mean   4.500000   5.500000   6.500000
std    3.872983   3.872983   3.872983

In [12]:
d.applymap(lambda x: x%3)

   a  b  c
0  0  1  2
1  0  1  2
2  0  1  2
3  0  1  2

In [13]:
d.a.map(lambda x: x**2) # Series 에만 적용 가능

0     0
1     9
2    36
3    81
Name: a, dtype: int64

In [14]:
d.a.apply(lambda x: x**2)

0     0
1     9
2    36
3    81
Name: a, dtype: int64

In [27]:
d.a.apply(lambda x: pd.Series([x,x**2,x**3]))

   0   1    2
0  0   0    0
1  3   9   27
2  6  36  216
3  9  81  729

In [58]:
d.a

0    0
1    3
2    6
3    9
Name: a, dtype: int32

In [61]:
d.a.map({0:'zero', 1:'one', 3:'three', 6:'six'})

0     zero
1    three
2      six
3      NaN
Name: a, dtype: object

### 정렬
- sort_values()
- sort_index()

In [72]:
d = pd.DataFrame(np.random.randint(1,7,size=[4,3]), columns=list('abc'))
d

   a  b  c
0  5  5  3
1  4  1  1
2  5  4  6
3  1  4  2

In [73]:
d.sort_values('b')

   a  b  c
1  4  1  1
2  5  4  6
3  1  4  2
0  5  5  3

In [74]:
d.sort_values('b').reset_index(drop=True)

   a  b  c
0  4  1  1
1  5  4  6
2  1  4  2
3  5  5  3

In [75]:
d.sort_values(['a','b'])

   a  b  c
3  1  4  2
1  4  1  1
2  5  4  6
0  5  5  3

In [76]:
d2 = d.sort_values(by='c', ascending=False)
d2

   a  b  c
2  5  4  6
0  5  5  3
3  1  4  2
1  4  1  1

In [77]:
d2.sort_index()

   a  b  c
0  5  5  3
1  4  1  1
2  5  4  6
3  1  4  2

### 요약 통계
- 228쪽 표
- argmin, argmax, idxmin, idxmax

In [28]:
d = pd.DataFrame(np.random.randint(1,7,size=[4,3]), columns=list('abc'))
d

   a  b  c
0  5  1  2
1  3  1  1
2  5  4  4
3  1  2  2

In [29]:
d.sum() # default: axis=0

a    14
b     8
c     9
dtype: int64

In [80]:
d.mean()

a    4.00
b    4.50
c    2.25
dtype: float64

In [30]:
d.mean(axis=1) # skipna=True

0    1.333333
1    3.333333
2    3.666667
3    2.000000
dtype: float64

In [30]:
d.pct_change() # 앞에 값을 기준으로 변화률을 측정

          a    b    c
0       NaN  NaN  NaN
1 -0.400000  0.0 -0.5
2  0.666667  3.0  3.0
3 -0.800000 -0.5 -0.5

### 상관관계

In [32]:
d.corr()

          a         b         c
a  1.000000 -0.816497 -0.268866
b -0.816497  1.000000  0.548821
c -0.268866  0.548821  1.000000

In [33]:
d.a.corr(d.b)

-0.816496580927726

In [35]:
d.cov() # 공분산

     a    b         c
a  2.0 -2.0 -1.000000
b -2.0  3.0  2.500000
c -1.0  2.5  6.916667

### 카운트
- value_counts()
- unique()
- isin()

In [31]:
d

   a  b  c
0  5  1  2
1  3  1  1
2  5  4  4
3  1  2  2

In [32]:
d.a.value_counts()

5    2
3    1
1    1
Name: a, dtype: int64

In [86]:
d.a.value_counts(ascending=True)

4    1
6    1
3    2
Name: a, dtype: int64

In [33]:
d.a.unique()

array([5, 3, 1], dtype=int64)

In [34]:
d.isin([5,6])

       a      b      c
0   True  False  False
1  False  False  False
2   True  False  False
3  False  False  False

- 각 열의 카운트를 구하여 데이터프레임을 만든다

In [68]:
d = pd.DataFrame(np.random.randint(6,size=[4,3]), columns=list('abc'))
d

   a  b  c
0  3  5  4
1  0  1  4
2  0  3  2
3  3  1  0

In [69]:
pd.value_counts(d.a)

3    2
0    2
Name: a, dtype: int64

In [70]:
pd.value_counts(d.b)

1    2
3    1
5    1
Name: b, dtype: int64

In [71]:
pd.value_counts(d.c)

4    2
2    1
0    1
Name: c, dtype: int64

In [72]:
d.apply(pd.value_counts)

     a    b    c
0  2.0  NaN  1.0
1  NaN  2.0  NaN
2  NaN  NaN  1.0
3  2.0  1.0  NaN
4  NaN  NaN  2.0
5  NaN  1.0  NaN

In [48]:
d.apply(pd.value_counts).fillna(0)

     a    b    c
0  0.0  1.0  2.0
1  0.0  2.0  0.0
2  1.0  0.0  0.0
4  1.0  1.0  1.0
5  2.0  0.0  1.0

### 텍스트파일 읽기
- 6장
- read_csv()

In [73]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers:

read_csv(filepath_or_buffer, sep=',', delimiter=None, header='infer', names=None, index_col=None, usecols=None, squeeze=False, prefix=None, mangle_dupe_cols=True, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=False, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, iterator=False, chunksize=None, compression='infer', thousands=None, decimal=b'.', lineterminator=None, quotechar='"', quoting=0, escapechar=None, comment=None, encoding=None, dialect=None, tupleize_cols=None, error_bad_lines=True, warn_bad_lines=True, skipfooter=0, skip_footer=0, doublequote=True, delim_whitespace=False, as_recarray=None, compact_ints=None, use_unsigned=None, low_memory=True, buffer_lines=None, memory_map=False, float_precision=None)
    Read CSV (comma-separated) file into DataFrame

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the `online docs for IO Tools
    <http://pandas.pydata.org/pandas-docs/stable/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, pathlib.Path, py._path.local.LocalPath or any object with a read() method (such as a file handle or StringIO)
        The string could be a URL. Valid URL schemes include http, ftp, s3, and
        file. For file URLs, a host is expected. For instance, a local file could
        be file ://localhost/path/to/table.csv
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``
    delimiter : str, default ``None``
        Alternative argument name for sep.
    delim_whitespace : boolean, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.

        .. versionadded:: 0.18.1 support for the Python parser.

    header : int or list of ints, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so header=0 denotes the first line of
        data rather than the first line of the file.
    names : array-like, default None
        List of column names to use. If file contains no header row, then you
        should explicitly pass header=None. Duplicates in this list will cause
        a ``UserWarning`` to be issued.
    index_col : int or sequence or False, default None
        Column to use as the row labels of the DataFrame. If a sequence is given, a
        MultiIndex is used. If you have a malformed file with delimiters at the end
        of each line, you might consider index_col=False to force pandas to _not_
        use the first column as the index (row names)
    usecols : array-like or callable, default None
        Return a subset of the columns. If array-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). For example, a valid array-like
        `usecols` parameter would be [0, 1, 2] or ['foo', 'bar', 'baz'].

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    as_recarray : boolean, default False
        .. deprecated:: 0.19.0
           Please call `pd.read_csv(...).to_records()` instead.

        Return a NumPy recarray instead of a DataFrame after parsing the data.
        If set to True, this option takes precedence over the `squeeze` parameter.
        In addition, as row indices are not available in such a format, the
        `index_col` parameter will be ignored.
    squeeze : boolean, default False
        If the parsed data only contains one column then return a Series
    prefix : str, default None
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...
    mangle_dupe_cols : boolean, default True
        Duplicate columns will be specified as 'X.0'...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, default None
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32}
        Use `str` or `object` to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python'}, optional
        Parser engine to use. The C engine is faster while the python engine is
        currently more feature-complete.
    converters : dict, default None
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels
    true_values : list, default None
        Values to consider as True
    false_values : list, default None
        Values to consider as False
    skipinitialspace : boolean, default False
        Skip spaces after delimiter.
    skiprows : list-like or integer or callable, default None
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c')
    skip_footer : int, default 0
        .. deprecated:: 0.19.0
           Use the `skipfooter` parameter instead, as they are identical
    nrows : int, default None
        Number of rows of file to read. Useful for reading pieces of large files
    na_values : scalar, str, list-like, or dict, default None
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', 'N/A', 'NA', 'NULL', 'NaN', 'n/a', 'nan',
        'null'.
    keep_default_na : bool, default True
        If na_values are specified and keep_default_na is False the default NaN
        values are overridden, otherwise they're appended to.
    na_filter : boolean, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file
    verbose : boolean, default False
        Indicate number of NA values placed in non-numeric columns
    skip_blank_lines : boolean, default True
        If True, skip over blank lines rather than interpreting as NaN values
    parse_dates : boolean or list of ints or names or list of lists or dict, default False

        * boolean. If True -> try parsing the index.
        * list of ints or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call result
          'foo'

        If a column or index contains an unparseable date, the entire column or
        index will be returned unaltered as an object data type. For non-standard
        datetime parsing, use ``pd.to_datetime`` after ``pd.read_csv``

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : boolean, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : boolean, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, default None
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : boolean, default False
        DD/MM format dates, international and European format
    iterator : boolean, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.
    chunksize : int, default None
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <http://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.
    compression : {'infer', 'gzip', 'bz2', 'zip', 'xz', None}, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and
        `filepath_or_buffer` is path-like, then detect compression from the
        following extensions: '.gz', '.bz2', '.zip', or '.xz' (otherwise no
        decompression). If using 'zip', the ZIP file must contain only one data
        file to be read in. Set to None for no decompression.

        .. versionadded:: 0.18.1 support for 'zip' and 'xz' compression.

    thousands : str, default None
        Thousands separator
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    float_precision : string, default None
        Specifies which converter the C engine should use for floating-point
        values. The options are `None` for the ordinary converter,
        `high` for the high-precision converter, and `round_trip` for the
        round-trip converter.
    lineterminator : str (length 1), default None
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : boolean, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), default None
        One-character string used to escape delimiter when quoting is QUOTE_NONE.
    comment : str, default None
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if comment='#', parsing '#empty\na,b,c\n1,2,3'
        with `header=0` will result in 'a,b,c' being
        treated as the header.
    encoding : str, default None
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_
    dialect : str or csv.Dialect instance, default None
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    tupleize_cols : boolean, default False
        .. deprecated:: 0.21.0
           This argument will be removed and will always convert to MultiIndex

        Leave a list of tuples on columns as is (default is to convert to
        a MultiIndex on the columns)
    error_bad_lines : boolean, default True
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will dropped from the DataFrame that is
        returned.
    warn_bad_lines : boolean, default True
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.
    low_memory : boolean, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser)
    buffer_lines : int, default None
        .. deprecated:: 0.19.0
           This argument is not respected by the parser
    compact_ints : boolean, default False
        .. deprecated:: 0.19.0
           Argument moved to ``pd.to_numeric``

        If compact_ints is True, then for any column that is of integer dtype,
        the parser will attempt to cast it as the smallest integer dtype possible,
        either signed or unsigned depending on the specification from the
        `use_unsigned` parameter.
    use_unsigned : boolean, default False
        .. deprecated:: 0.19.0
           Argument moved to ``pd.to_numeric``

        If integer columns are being compacted (i.e. `compact_ints=True`), specify
        whether the column should be compacted to the smallest signed or unsigned
        integer dtype.
    memory_map : boolean, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.

    Returns
    -------
    result : DataFrame or TextParser

In [74]:
#subway = pd.read_csv('CARD_SUBWAY_MONTH_201905.csv')

In [37]:
subway = pd.read_csv('CARD_SUBWAY_MONTH_202006.csv')

In [38]:
subway.head()

       사용일자  노선명   역명  승차총승객수  하차총승객수      등록일자  역ID
0  20200601  5호선  개화산    5145    4899  20200604  NaN
1  20200601  3호선   불광   15920   17131  20200604  NaN
2  20200601  2호선  신도림   47364   46161  20200604  NaN
3  20200601  3호선  연신내   37604   35416  20200604  NaN
4  20200601  3호선  구파발   20615   19107  20200604  NaN

In [39]:
subway.tail()

           사용일자  노선명        역명  승차총승객수  하차총승객수      등록일자  역ID
17734  20200630  장항선  쌍용(나사렛대)    1744    1598  20200703  NaN
17735  20200630  장항선        봉명    1115    1034  20200703  NaN
17736  20200630  일산선        대화   13097    9865  20200703  NaN
17737  20200630  일산선        주엽    8370    8470  20200703  NaN
17738  20200630  일산선       정발산    6466    6530  20200703  NaN

In [40]:
subway.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17739 entries, 0 to 17738
Data columns (total 7 columns):
사용일자      17739 non-null int64
노선명       17739 non-null object
역명        17739 non-null object
승차총승객수    17739 non-null int64
하차총승객수    17739 non-null int64
등록일자      17739 non-null int64
역ID       0 non-null float64
dtypes: float64(1), int64(4), object(2)
memory usage: 970.2+ KB

In [42]:
subway.describe()

               사용일자        승차총승객수        하차총승객수          등록일자  역ID
count  1.773900e+04  17739.000000  17739.000000  1.773900e+04  0.0
mean   2.020062e+07   9704.010767   9673.921303  2.020063e+07  NaN
std    8.653972e+00   9730.929314   9887.628982  2.655659e+01  NaN
min    2.020060e+07      1.000000      0.000000  2.020060e+07  NaN
25%    2.020061e+07   3269.500000   3166.500000  2.020061e+07  NaN
50%    2.020062e+07   6974.000000   6859.000000  2.020062e+07  NaN
75%    2.020062e+07  12801.000000  12577.000000  2.020063e+07  NaN
max    2.020063e+07  91789.000000  95614.000000  2.020070e+07  NaN

In [46]:
subway.역명.unique().shape

(510,)